[
   "Yes, I have a question.",
   "Why didn't you use MongoDB?",
   "MongoDB is a web-scale database and doesn't use SQL or joins so it's high performance.",
   "But it doesn't scale.",
   "Everybody knows that relational databases don't scale because they use joins and write to disk.",
   "Relational databases weren't built for web-scale.",
   "MongoDB handles web-scale; you turn it on and it scales right up.",
   "Relational databases have impotence mismatch.",
   "mysql is slow as a dog.",
   "MongoDB will run circles around mysql because MongoDB is web scale.",
   "If that's what they need to do to get those kick-ass benchmarks then it's a great design.",
   "If `/dev/null` is fast and web-scale, I will use it.",
   "Is it web-scale?",
   "Does `/dev/null` support sharding?",
   "Shards are the secret ingredient in the web-scale sauce: they just work",
   "I'm a web programmer.",
   "Redis will kick memcache's ass.",
   "It's so fast and scalable.",
   "MongoDB is a document database that doesn't need joins.",
   "It uses MapReduce.",
   "By writing to memory map files, MongoDB can improve its write throughput by a factor of ten.",
   "MongoDB uses atomic modifiers for contention free performance.",
   "MongoDB stores files of any size without complicating your stack.",
   "Yes, I have a question.",
   "Why didn't you use Node.js?",
   "Node.js is an event-driven non-blocking I/O server that can be used to build high-performance web applications.",
   "But it doesn't have performance.",
   "Everybody knows that Apache applications are slow because they use blocking I/O and have context switches.",
   "Threads don't scale.",
   "Simple as that.",
   "Node.js will run circles around Apache because Apache was built before async was discovered.",
   "Tt gives techies like me the control to wring every last CPU cycle out of our servers.",
   "I'm a total speed junkie.",
   "The invention of the transistor?",
   "But it's slow as a dog.",
   "But it's fast as hell.",
   "Node.js is the most badass rockstars tech to come out since Ruby on Rails.",
   "Non-blocking is the secret in the async sauce.",
   "With it, you go fast.",
   "Without it, you go slow.",
   "1492: Columbus sailed the ocean blue",
   "Sounds low-tech.",
   "I'm sorry what was that last part again?",
   "Did you say \"Lisp\".",
   "I could have sworn you just said \"Lisp\"."
]