{
   "title": "Node.js is Bad-ass Rockstar Tech",
   "tags": [
      "node",
      "node.js",
      "nodejs",
      "js",
      "javascript",
      "rockstar",
      "async",
      "concurrency",
      "event loop"
   ],
   "disabled": false,
   "sentences": [
      [
         "beige",
         "And in conclusion, we have found Apache to be an excellent server for our web applications."
      ],
      [
         "beige",
         "Any questions?"
      ],
      [
         "brown",
         "Yes, I have a question."
      ],
      [
         "brown",
         "Why didn't you use Node.js?"
      ],
      [
         "brown",
         "Node.js is an event-driven non-blocking I/O server that can be used to build high-performance web applications."
      ],
      [
         "beige",
         "That is an excellent question."
      ],
      [
         "beige",
         "We evaluated several alternative web servers and concluded that while options like Node.js are very interesting, Apache meets our needs and has a solid track record."
      ],
      [
         "brown",
         "But it doesn't have performance."
      ],
      [
         "brown",
         "Everybody knows that Apache applications are slow because they use blocking I/O and have context switches."
      ],
      [
         "beige",
         "That's a commonly held belief that threaded web servers are somehow less performant or scalable than event based servers."
      ],
      [
         "beige",
         "In fact, if you measure carefully, you will find that both models have similar performance characteristics."
      ],
      [
         "brown",
         "Threads don't scale."
      ],
      [
         "brown",
         "Simple as that."
      ],
      [
         "beige",
         "That may have been true ten years ago."
      ],
      [
         "beige",
         "It's not true today."
      ],
      [
         "brown",
         "Node.js will run circles around Apache because Apache was built before async was discovered."
      ],
      [
         "beige",
         "This is where I typically stab myself repeatedly in the ears with a fork until I stop hearing you."
      ],
      [
         "beige",
         "I've looked at node it uses a single threaded loop that dispatches events to handlers."
      ],
      [
         "beige",
         "It's a proven model that solves some concurrency problems but at the cost of code complexity."
      ],
      [
         "brown",
         "Tt gives techies like me the control to wring every last CPU cycle out of our servers."
      ],
      [
         "beige",
         "It must feel empowering to be totally responsible for the performance of your application, to be always on the lookout for blocking operations that should be split into little pieces, each perfectly tailored to optimize concurrent throughput."
      ],
      [
         "beige",
         "All the complexities of assembler with the efficiencies of JavaScript."
      ],
      [
         "brown",
         "I'm a total speed junkie."
      ],
      [
         "beige",
         "Do you know what this reminds me of?"
      ],
      [
         "brown",
         "The invention of the transistor?"
      ],
      [
         "beige",
         "It reminds me of the invention of threads."
      ],
      [
         "beige",
         "Threading libraries do exactly what you were doing manually."
      ],
      [
         "beige",
         "They break up pieces of code to be executed intermittently, switching from instructions that are waiting on IO to instructions that are ready to run but your sequential code stays intact."
      ],
      [
         "beige",
         "You may recall sequential code."
      ],
      [
         "beige",
         "That's code you can read."
      ],
      [
         "brown",
         "But it's slow as a dog."
      ],
      [
         "beige",
         "Your async program is like something from a 19th century gothic horror story."
      ],
      [
         "beige",
         "Drunk with your own sense of power, you reassemble pieces of code that were once coherent, stitching them together with event loops and callback functions until your monster, grotesque and menacing is ready to be brought to life in a JavaScript VM."
      ],
      [
         "beige",
         "You throw the switch and the hideous creature awakes, rises, and lurches forward."
      ],
      [
         "beige",
         "You're simultaneously elated and terrified that something so unnatural could work at all."
      ],
      [
         "beige",
         "When you realize what you've unleashed, the pure morality of it, your creation reaches out with its bloodied mangled arms and strangles you."
      ],
      [
         "brown",
         "But it's fast as hell."
      ],
      [
         "beige",
         "If you're willing to suffer complex code for performance, why not write an nginx module in C?"
      ],
      [
         "brown",
         "Node.js is the most badass rockstars tech to come out since Ruby on Rails."
      ],
      [
         "beige",
         "As much as I want to be an optimist and look forward to human progress, people like you stopped me dead in my tracks."
      ],
      [
         "beige",
         "You're a fanatic in the Church of Technology Fashion."
      ],
      [
         "beige",
         "I could present you with fact after fact after fact that your thinking about asynchronous programming is completely wrong."
      ],
      [
         "beige",
         "But why bother when you equate technology to rock bands, fancy yourself a software hipster by wearing your Node t-shirt, and celebrate horrible code."
      ],
      [
         "beige",
         "Maybe you are cool."
      ],
      [
         "beige",
         "Hell, maybe you have groupies."
      ],
      [
         "beige",
         "But when it comes to knowing what the fuck you are talking about, you have all the facilities of a parrot that says non-blocking over and over again."
      ],
      [
         "brown",
         "Non-blocking is the secret in the async sauce."
      ],
      [
         "brown",
         "With it, you go fast."
      ],
      [
         "brown",
         "Without it, you go slow."
      ],
      [
         "beige",
         "Do you know when humans discovered that the world is round?"
      ],
      [
         "brown",
         "1492: Columbus sailed the ocean blue"
      ],
      [
         "beige",
         "It was 240 BC by a Greek mathematician named Eratosthenes."
      ],
      [
         "beige",
         "He conducted a simple experiment using the length of shadows and the distance between cities to not only prove the earth is round, but also calculate its circumference"
      ],
      [
         "brown",
         "Sounds low-tech."
      ],
      [
         "beige",
         "It was utterly brilliant but somehow for one and a half millennia, it was common knowledge that the world was flat."
      ],
      [
         "beige",
         "Hundreds and hundreds and hundreds of years of raft ignorance."
      ],
      [
         "beige",
         "How in the motherfucking-hell does this happen?!"
      ],
      [
         "beige",
         "It was you."
      ],
      [
         "beige",
         "**You** who made claims about thread performance without measuring."
      ],
      [
         "beige",
         "**You** who claimed hacking your code with a machete, turning it inside out into a twisted and recognizable mess will somehow make it go faster."
      ],
      [
         "beige",
         "**You** who spent your time alternating between problems that are already solved and problems that don't actually exist."
      ],
      [
         "beige",
         "You are the reason science was set back a thousand years,"
      ],
      [
         "beige",
         "the reason we have not cured cancer,"
      ],
      [
         "beige",
         "the reason we have not solved world hunger."
      ],
      [
         "beige",
         "It's because of **you**, motherfucker, that we're not all using Lisp."
      ],
      [
         "brown",
         "I'm sorry what was that last part again?"
      ],
      [
         "beige",
         "Nevermind."
      ],
      [
         "brown",
         "Did you say \"Lisp\"."
      ],
      [
         "beige",
         "You misheard me."
      ],
      [
         "brown",
         "I could have sworn you just said \"Lisp\"."
      ],
      [
         "beige",
         "If there are no other questions, this concludes my presentation."
      ]
   ]
}